results_mongodb/workloadA/run3
/usr/bin/java  -classpath /home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/conf:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/lib/core-0.17.0.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/logback-core-1.1.2.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p mongodb.url=mongodb://127.0.0.1:27017/ycsb?w=1
mongo client connection created with mongodb://127.0.0.1:27017/ycsb?w=1
[OVERALL], RunTime(ms), 2939
[OVERALL], Throughput(ops/sec), 340.25178632187817
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 40
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.3610071452875128
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 40
[TOTAL_GC_TIME_%], Time(%), 1.3610071452875128
[READ], Operations, 517
[READ], AverageLatency(us), 1665.7640232108317
[READ], MinLatency(us), 540
[READ], MaxLatency(us), 15495
[READ], 95thPercentileLatency(us), 4639
[READ], 99thPercentileLatency(us), 7175
[READ], Return=OK, 517
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 6734.0
[CLEANUP], MinLatency(us), 6732
[CLEANUP], MaxLatency(us), 6735
[CLEANUP], 95thPercentileLatency(us), 6735
[CLEANUP], 99thPercentileLatency(us), 6735
[UPDATE], Operations, 483
[UPDATE], AverageLatency(us), 2907.1884057971015
[UPDATE], MinLatency(us), 623
[UPDATE], MaxLatency(us), 107199
[UPDATE], 95thPercentileLatency(us), 5907
[UPDATE], 99thPercentileLatency(us), 8679
[UPDATE], Return=OK, 483